app/controllers/posts_controller.rb

  def index
    @user = User.find(1)
    @posts = Post.all
---
SELECT  `users`.* FROM `users`  WHERE `users`.`id` = 1 LIMIT 1
SELECT `posts`.* FROM `posts`

  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO `posts` (`content`, `created_at`, `image`, `title`, `updated_at`) VALUES ('テスト', '2014-11-08 18:26:11', '20141108182611', 'テスト', '2014-11-08 18:26:11')